{
  "personal": {
    "name": "Hareesh Raj",
    "title": "Full Stack Developer",
    "bio": "Results-driven Full Stack Developer with a strong background in building scalable ecommerce applications using microservices architecture and RESTful services. Experienced in Java, Spring Boot, React.js and MySQL with a proven track record of delivering high-performance solutions.",
    "location": "Chennai, India",
    "email": "hareesh1705@gmail.com",
    "photo": "/images/photo.jpg",
    "doodle": "/images/avatar.png"
  },
  "experience": [
    {
      "company": "CDW",
      "role": "Consultant",
      "duration": "2025 - Present",
      "description": "As a core developer, I drove the successful launch of our new e-commerce platform, boosting efficiency by building a library of reusable components and integrating critical services like Avalara, Klaviyo, and ShipHero. I built the complete gift card lifecycle and a user-friendly dashboard for order tracking. Additionally, I managed a complex legacy system migration while preserving SEO rankings and mentored junior developers to ensure alignment with US stakeholders.",
      "location": "Chennai, India"
    },
    {
      "company": "CDW",
      "role": "Associate Consultant",
      "duration": "2024 - 2025",
      "description": "Worked on a hotel booking engine where I optimized RESTful APIs and automated order synchronization, driving a 12% revenue increase and an 85% efficiency boost. I developed scalable backend solutions, revamped user interfaces for better engagement, and integrated critical systems like Hapi CRM and Celopay. Additionally, I enhanced content management, implemented message queues for asynchronous processing, and led SEO optimizations, all while collaborating with stakeholders to drive innovation.",
      "location": "Chennai, India"
    },
    {
      "company": "CDW",
      "role": "Trainee Consultant",
      "duration": "2023 - 2024",
      "description": "I contributed to an internal event website by building reusable front-end components that reduced development time by 25%. I also worked on the architecture for a test proctoring system and an online code compiler, implementing full-stack solutions to handle high traffic during campus hiring—efforts that reduced costs by 75%. Furthermore, I implemented Redis caching to improve site performance by 95% and optimized backend controllers for a seamless user experience.",
      "location": "Chennai, India"
    },
    {
      "company": "CDW",
      "role": "Student Intern",
      "duration": "Feb 2023 - May 2023",
      "description": "Built interactive online exam monitoring application used for campus recruitment. Collaborated with designers to bring award-winning concepts to life using SpringBoot and React.",
      "location": "Chennai, India"
    }
  ],
  "education": [
    {
      "institution": "Kongu Engineering College",
      "degree": "B.E. Computer Science",
      "year": "2019-2023",
      "description": "Specialized in Web Development and Distributed Systems. Published research on deep learning for image classification.",
      "location": "Erode, India"
    },
    {
      "institution": "Bharani Park Higher Secondary School",
      "degree": "High School",
      "year": "2017-2019",
      "description": "Completed my high school education with a strong foundation in computer science.",
      "location": "Karur, India"
    }
  ],
  "skills": [
    "SpringBoot",
    "React",
    "TypeScript",
    "Node.js",
    "Tailwind CSS",
    "Next.js",
    "GraphQL",
    "Git",
    "RabbitMQ",
    "PostgreSQL",
    "Docker"
  ],
  "recommendations": [
    {
      "id": 1,
      "name": "Mounika Murugeshan",
      "position": "Senior Developer",
      "company": "CDW",
      "image": "/images/mounika_reco_img.jpeg",
      "text": "I had the pleasure of working with Hareesh during my time at CDW, and his skills and dedication are exceptional. Though he is a budding talent in the field, his proactive learning approach and impressive full-stack development skills truly distinguish him. He excels at understanding project requirements, supporting his team, and continuously seeking feedback to improve. Beyond his technical abilities, Hareesh is also a fun person to work with, bringing enthusiasm and a positive attitude to the team. He’s a promising new talent and a valuable asset to any team. I highly recommend him.",
      "linkedin": "https://www.linkedin.com/in/mounika-murugeshan/"
    }
  ],
  "topSkills": [
    "Java",
    "SpringBoot",
    "ReactJS"
  ],
  "social": {
    "linkedin": "https://www.linkedin.com/in/hareesh-raj-ramanathan/",
    "leetcode": "https://leetcode.com/u/hareesh1705/",
    "medium": "https://medium.com/@hareesh1705"
  }
}